coocox/Mplib/Toshaba/TMPM36x/TMPM364/cmsis_lib/lib/cmsis_boot/startup/coide/startup_coide.c
    INT0_IRQHandler              ,          //0:  Interrupt pin 0
    INT1_IRQHandler              ,          //1:  Interrupt pin 1
    INT2_IRQHandler              ,          //2:  Interrupt pin 2
    INT3_IRQHandler              ,          //3:  Interrupt pin 3
    INT4_IRQHandler              ,          //4:  Interrupt pin 4
    INT5_IRQHandler              ,          //5:  Interrupt pin 5
    INT6_IRQHandler              ,          //6:  Interrupt pin 6
    INT7_IRQHandler              ,          //7:  Interrupt pin 7
    INT8_IRQHandler              ,          //8:  Interrupt pin 8
    INT9_IRQHandler              ,          //9:  Interrupt pin 9
    INTA_IRQHandler              ,          //10: Interrupt pin A
    INTB_IRQHandler              ,          //11: Interrupt pin B
    INTC_IRQHandler              ,          //12: Interrupt pin C
    INTD_IRQHandler              ,          //13: Interrupt pin D
    INTE_IRQHandler              ,          //14: Interrupt pin E
    INTF_IRQHandler              ,          //15: Interrupt pin F
    INTRX0_IRQHandler            ,          //16: Serial reception (channel.0)
    INTTX0_IRQHandler            ,          //17: Serial transmission (channel.0)
    INTRX1_IRQHandler            ,          //18: Serial reception (channel.1)
    INTTX1_IRQHandler            ,          //19: Serial transmission (channel.1)
    INTRX2_IRQHandler            ,          //20: Serial reception (channel.2)
    INTTX2_IRQHandler            ,          //21: Serial transmission (channel.2)
    INTRX3_IRQHandler            ,          //22: Serial reception (channel.3)
    INTTX3_IRQHandler            ,          //23: Serial transmission (channel.3)
    INTRX4_IRQHandler            ,          //24: Serial reception (channel.4)
    INTTX4_IRQHandler            ,          //25: Serial transmission (channel.4)
    INTSBI0_IRQHandler           ,          //26: Serial bus interface (channel.0)
    INTSBI1_IRQHandler           ,          //27: Serial bus interface (channel.1)
    INTCECRX_IRQHandler          ,          //28: CEC reception
    INTCECTX_IRQHandler          ,          //29: CEC transmission
    INTRMCRX0_IRQHandler         ,          //30: Remote control signal reception (channel.0)
    INTRMCRX1_IRQHandler         ,          //31: Remote control signal reception (channel.1)
    INTRTC_IRQHandler            ,          //32: Real time clock timer
    INTKWUP_IRQHandler           ,          //33: Key on wake up
    INTSBI2_IRQHandler           ,          //34: Serial bus interface (channel.2)
    INTSBI3_IRQHandler           ,          //35: Serial bus interface (channel.3)
    INTSBI4_IRQHandler           ,          //36: Serial bus interface (channel.4)
    INTADHP_IRQHandler           ,          //37: Highest priority AD conversion complete interrupt 
    INTADM0_IRQHandler           ,          //38: AD conversion monitoring function interrupt 0
    INTADM1_IRQHandler           ,          //39: AD conversion monitoring function interrupt 1
    INTTB0_IRQHandler            ,          //40: 16bit TMRB match detection 0
    INTTB1_IRQHandler            ,          //41: 16bit TMRB match detection 1
    INTTB2_IRQHandler            ,          //42: 16bit TMRB match detection 2
    INTTB3_IRQHandler            ,          //43: 16bit TMRB match detection 3
    INTTB4_IRQHandler            ,          //44: 16bit TMRB match detection 4
    INTTB5_IRQHandler            ,          //45: 16bit TMRB match detection 5
    INTTB6_IRQHandler            ,          //46: 16bit TMRB match detection 6
    INTTB7_IRQHandler            ,          //47: 16bit TMRB match detection 7
    INTTB8_IRQHandler            ,          //48: 16bit TMRB match detection 8
    INTTB9_IRQHandler            ,          //49: 16bit TMRB match detection 9
    INTTBA_IRQHandler            ,          //50: 16bit TMRB match detection A
    INTTBB_IRQHandler            ,          //51: 16bit TMRB match detection B
    INTTBC_IRQHandler            ,          //52: 16bit TMRB match detection C
    INTTBD_IRQHandler            ,          //53: 16bit TMRB match detection D
    INTTBE_IRQHandler            ,          //54: 16bit TMRB match detection E
    INTTBF_IRQHandler            ,          //55: 16bit TMRB match detection F
    INTUSB_IRQHandler            ,          //56: USB
    INTCANGB_IRQHandler          ,          //57: CAN status
    INTAD_IRQHandler             ,          //58: ADC conversion completion
    INTSSP_IRQHandler            ,          //59: Synchronous Serial Port
    INTRX5_IRQHandler            ,          //60: Serial reception (channel.5)
    INTTX5_IRQHandler            ,          //61: Serial transmission (channel.5)
    INTRX6_IRQHandler            ,          //62: Serial reception (channel.6)
    INTTX6_IRQHandler            ,          //63: Serial transmission (channel.6)
    INTRX7_IRQHandler            ,          //64: Serial reception (channel.7)
    INTTX7_IRQHandler            ,          //65: Serial transmission (channel.7)
    INTRX8_IRQHandler            ,          //66: Serial reception (channel.8)
    INTTX8_IRQHandler            ,          //67: Serial transmission (channel.8)
    INTRX9_IRQHandler            ,          //68: Serial reception (channel.9)
    INTTX9_IRQHandler            ,          //69: Serial transmission (channel.9)
    INTRX10_IRQHandler           ,          //70: Serial reception (channel.10)
    INTTX10_IRQHandler           ,          //71: Serial transmission (channel.10)
    INTRX11_IRQHandler           ,          //72: Serial reception (channel.11)
    INTTX11_IRQHandler           ,          //73: Serial transmission (channel.11)
    INTCAP10_IRQHandler          ,          //74: 16bit TMRB input capture 10
    INTCAP11_IRQHandler          ,          //75: 16bit TMRB input capture 11
    INTCAP20_IRQHandler          ,          //76: 16bit TMRB input capture 20
    INTCAP21_IRQHandler          ,          //77: 16bit TMRB input capture 21
    INTCANRX_IRQHandler          ,          //78: CAN Reception
    INTCANTX_IRQHandler          ,          //79: CAN Transmission
    INTCAP50_IRQHandler          ,          //80: 16bit TMRB input capture 50
    INTCAP51_IRQHandler          ,          //81: 16bit TMRB input capture 51
    INTCAP60_IRQHandler          ,          //82: 16bit TMRB input capture 60
    INTCAP61_IRQHandler          ,          //83: 16bit TMRB input capture 61
    INTCAP70_IRQHandler          ,          //84: 16bit TMRB input capture 70
    INTCAP71_IRQHandler          ,          //85: 16bit TMRB input capture 71
    INTCAP90_IRQHandler          ,          //86: 16bit TMRB input capture 90
    INTCAP91_IRQHandler          ,          //87: 16bit TMRB input capture 91
    INTCAPA0_IRQHandler          ,          //88: 16bit TMRB input capture A0
    INTCAPA1_IRQHandler          ,          //89: 16bit TMRB input capture A1
    INTCAPB0_IRQHandler          ,          //90: 16bit TMRB input capture B0
    INTCAPB1_IRQHandler          ,          //91: 16bit TMRB input capture B1
    INTCAPD0_IRQHandler          ,          //92: 16bit TMRB input capture D0
    INTCAPD1_IRQHandler          ,          //93: 16bit TMRB input capture D1
    INTCAPE0_IRQHandler          ,          //94: 16bit TMRB input capture E0
    INTCAPE1_IRQHandler          ,          //95: 16bit TMRB input capture E1
    INTCAPF0_IRQHandler          ,          //96: 16bit TMRB input capture F0
    INTCAPF1_IRQHandler          ,          //97: 16bit TMRB input capture F1
    INTDMACERR_IRQHandler        ,          //98: DMA transmission error
    INTDMACTC0_IRQHandler        ,          //99: DMA transmission completion

