coocox/Mplib/Toshaba/TMPM36x/TMPM364/cmsis_lib/lib/cmsis_boot/startup/coide/startup_coide.c
};

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor first
//! starts execution following a reset event. 
//!
//! \param None.
//!
//! Only the absolutely necessary set is performed, after which the 
//! application supplied main() routine is called. 
//!
//! \return None.
//
//*****************************************************************************
void Default_ResetHandler(void)
{
    //
    // Initialize data and bss
    //
    unsigned long *pulSrc, *pulDest;

    //
    // Copy the data segment initializers from flash to SRAM
    //
    pulSrc = &_sidata;

    for(pulDest = &_sdata; pulDest < &_edata; )
    {
        *(pulDest++) = *(pulSrc++);
    }

    //
    // Zero fill the bss segment.
    //
    for(pulDest = &_sbss; pulDest < &_ebss; )
    {
        *(pulDest++) = 0;
    }

    //
    // Call the application's entry point.
    //
    SystemInit();
    main();
}

//*****************************************************************************
//
// Provide weak aliases for each Exception handler to the DefaultIntHandler. 
// As they are weak aliases, any function with the same name will override 
// this definition.
//
//*****************************************************************************  

#pragma weak ResetHandler           = Default_ResetHandler 
#pragma weak NMIIntHandler          = DefaultIntHandler 
#pragma weak HardFaultIntHandler    = DefaultIntHandler 
#pragma weak MemManageIntHandler    = DefaultIntHandler 
#pragma weak BusFaultIntHandler     = DefaultIntHandler 
#pragma weak UsageFaultIntHandler   = DefaultIntHandler 
#pragma weak SVCIntHandler          = DefaultIntHandler 
#pragma weak DebugMonIntHandler     = DefaultIntHandler 
#pragma weak PendSVIntHandler       = DefaultIntHandler 
#pragma weak SysTickIntHandler      = DefaultIntHandler 

#pragma weak INT0_IRQHandler        = DefaultIntHandler 
#pragma weak INT1_IRQHandler        = DefaultIntHandler 
#pragma weak INT2_IRQHandler        = DefaultIntHandler 
#pragma weak INT3_IRQHandler        = DefaultIntHandler 
#pragma weak INT4_IRQHandler        = DefaultIntHandler 
#pragma weak INT5_IRQHandler        = DefaultIntHandler 
#pragma weak INT6_IRQHandler        = DefaultIntHandler 
#pragma weak INT7_IRQHandler        = DefaultIntHandler 
#pragma weak INT8_IRQHandler        = DefaultIntHandler 
#pragma weak INT9_IRQHandler        = DefaultIntHandler 
#pragma weak INTA_IRQHandler        = DefaultIntHandler 
#pragma weak INTB_IRQHandler        = DefaultIntHandler 
#pragma weak INTC_IRQHandler        = DefaultIntHandler 
#pragma weak INTD_IRQHandler        = DefaultIntHandler 
#pragma weak INTE_IRQHandler        = DefaultIntHandler 
#pragma weak INTF_IRQHandler        = DefaultIntHandler 
#pragma weak INTRX0_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX0_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX1_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX1_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX2_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX2_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX3_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX3_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX4_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX4_IRQHandler      = DefaultIntHandler 
#pragma weak INTSBI0_IRQHandler     = DefaultIntHandler 
#pragma weak INTSBI1_IRQHandler     = DefaultIntHandler 
#pragma weak INTCECRX_IRQHandler    = DefaultIntHandler 
#pragma weak INTCECTX_IRQHandler    = DefaultIntHandler 
#pragma weak INTRMCRX0_IRQHandler   = DefaultIntHandler 
#pragma weak INTRMCRX1_IRQHandler   = DefaultIntHandler 
#pragma weak INTRTC_IRQHandler      = DefaultIntHandler 
#pragma weak INTKWUP_IRQHandler     = DefaultIntHandler 
#pragma weak INTSBI2_IRQHandler     = DefaultIntHandler 
#pragma weak INTSBI3_IRQHandler     = DefaultIntHandler 
#pragma weak INTSBI4_IRQHandler     = DefaultIntHandler 
#pragma weak INTADHP_IRQHandler     = DefaultIntHandler 
#pragma weak INTADM0_IRQHandler     = DefaultIntHandler 
#pragma weak INTADM1_IRQHandler     = DefaultIntHandler 
#pragma weak INTTB0_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB1_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB2_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB3_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB4_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB5_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB6_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB7_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB8_IRQHandler      = DefaultIntHandler 
#pragma weak INTTB9_IRQHandler      = DefaultIntHandler 
#pragma weak INTTBA_IRQHandler      = DefaultIntHandler 
#pragma weak INTTBB_IRQHandler      = DefaultIntHandler 
#pragma weak INTTBC_IRQHandler      = DefaultIntHandler 
#pragma weak INTTBD_IRQHandler      = DefaultIntHandler 
#pragma weak INTTBE_IRQHandler      = DefaultIntHandler 
#pragma weak INTTBF_IRQHandler      = DefaultIntHandler 
#pragma weak INTUSB_IRQHandler      = DefaultIntHandler 
#pragma weak INTCANGB_IRQHandler    = DefaultIntHandler 
#pragma weak INTAD_IRQHandler       = DefaultIntHandler 
#pragma weak INTSSP_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX5_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX5_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX6_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX6_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX7_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX7_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX8_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX8_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX9_IRQHandler      = DefaultIntHandler 
#pragma weak INTTX9_IRQHandler      = DefaultIntHandler 
#pragma weak INTRX10_IRQHandler     = DefaultIntHandler 
#pragma weak INTTX10_IRQHandler     = DefaultIntHandler 
#pragma weak INTRX11_IRQHandler     = DefaultIntHandler 
#pragma weak INTTX11_IRQHandler     = DefaultIntHandler 
#pragma weak INTCAP10_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP11_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP20_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP21_IRQHandler    = DefaultIntHandler 
#pragma weak INTCANRX_IRQHandler    = DefaultIntHandler 
#pragma weak INTCANTX_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP50_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP51_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP60_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP61_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP70_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP71_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP90_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAP91_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPA0_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPA1_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPB0_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPB1_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPD0_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPD1_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPE0_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPE1_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPF0_IRQHandler    = DefaultIntHandler 
#pragma weak INTCAPF1_IRQHandler    = DefaultIntHandler 
#pragma weak INTDMACERR_IRQHandler  = DefaultIntHandler 
#pragma weak INTDMACTC0_IRQHandler  = DefaultIntHandler 

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor receives an 
//! unexpected interrupt.  
//!
//! \param None.
//!
//! This simply enters an infinite loop, preserving the system state for 
//! examination by a debugger.
//!
//! \return None.  
//*****************************************************************************  
static void DefaultIntHandler(void) 
{
    //
    // Go into an infinite loop.
    //
    while (1) 
    {
    }
}

